"""

@file  : 002-求曲线与直线的相交面积.py

@author: xiaolu

@time  : 2020-05-15

"""
'''
求函数y^2=2Ax和y=Bx+C两个曲线所围出的面积。如果没有所围面积，则输出0

输入描述
第一行一个数n，表示测试用例的组数
接下来n行，每行输入三个数，分别是A B C
每个用例输出一个数，表示面积，相对误差在10^−4都算对

输入
1
1 1 -6

输出
31.2481110540(大概是这样，反正这样是对的)
'''
'''
思路: 首先联立两个方程求交点 如果没有交点 面积为0
y^2=2Ax, y=Bx+C将两个方程中的x, y交换 即: x^2=2Ay x=By+C   建立等式 x^2 / 2A = (x-C)/B 
将上面等式再整理: Bx^2-2Ax+2AC=0
对这个二次函数手动求定积分，求出来是个三次函数，然后带入上下限进行计算
'''
n = int(input())

for i in range(n):
    A, B, C = [int(i) for i in input().split(' ')]
    delt = 4 * A ** 2 - 4 * B * 2 * A * C
    if delt <= 0:
        print(0)
    else:
        # 求两根
        x1, x2 = (2*A/(2 * B) - delt ** 0.5 / (2 * B)), (2*A/(2 * B) + delt ** 0.5 / (2 * B))
        print((x1**3 / (6*A) - x1**2 / (2*B) + x1*C/B) - x2**3 / (6*A) + x2**2 / (2*B) - x2*C/B)
